# 'brew tap'
tap "homebrew/cask" # Default Casks Tap
tap "homebrew/cask-fonts" # Required for 'font-hasklug-nerd-font'
tap "homebrew/cask-versions" # Required for 'visual-studio'

# 'brew install'
brew "mas" # Mac App Store command-line interface
brew "git"
brew "bitwarden-cli"
brew "nvm" # Manage multiple Node.js versions
brew "yarn"
brew "pyenv" # Python version management
brew "htop"
brew "mysql"
brew "java"
brew "jenv" # Manage Java Environment

# 'brew install --cask'
cask "font-hasklug-nerd-font"
cask "google-chrome"
cask "warp"
cask "authy"
cask "raycast"
cask "linearmouse"
cask "whatsapp"
cask "telegram"
cask "visual-studio-code"
cask "firefox"
cask "rectangle"
cask "intellij-idea"
cask "monitorcontrol"
cask "nvidia-geforce-now"
cask "streamlabs-obs"
cask "onedrive"
cask "qbittorrent"
cask "raindropio"
cask "insomnia"
cask "languagetool"
cask "visual-studio"
cask "craft"
cask "hiddenbar"
cask "notion"
cask "mysqlworkbench"
cask "intellij-idea"
cask "fig"
cask "deepl"
cask "dotnet-sdk"
cask "malwarebytes"
cask "itsycal" # Toolbar Calendar
cask "discord"

# 'mas install'
mas "Adobe Lightroom", id: 1451544217
mas "CapCut - Video Editor", id: 1500855883
mas "Unzip - RAR ZIP 7Z Unarchiver", id: 1537056818
mas "Xcode", id: 497799835
mas "Malwarebytes Browser Guard", id: 1577761052
mas "DaVinci Resolve", id: 571213070
mas "Xnip - Screenshot & Annotation", id: 1221250572
mas "Bitwarden", id: 1352778147
