# 'brew tap'
tap "homebrew/cask-fonts" # Required for 'font-hasklug-nerd-font'

# 'brew install'
brew "mas" # Mac App Store command-line interface
brew "git"
brew "bitwarden-cli"
brew "nvm" # Manage multiple Node.js versions
brew "yarn"
brew "pyenv" # Python version management
brew "htop"
brew "mysql"
brew "java"
brew "jenv" # Manage Java Environment
brew "bat" # Modern replacement for 'cat' command
brew "lsd" # Modern replacement for 'ls' command
brew "git-extras" # Extra commands for git https://github.com/tj/git-extras
brew "tldr" # Simplified and community-driven man pages

# 'brew install --cask'
cask "font-hack-nerd-font"
cask "google-chrome"
cask "warp"
cask "authy"
cask "raycast"
cask "linearmouse"
cask "whatsapp"
cask "telegram"
cask "visual-studio-code"
cask "firefox"
cask "rectangle"
cask "monitorcontrol"
cask "nvidia-geforce-now"
cask "streamlabs-obs"
cask "onedrive"
cask "qbittorrent"
cask "raindropio"
cask "insomnia" # API Development & Testing Tool (Alternative to Postman)
cask "languagetool"
cask "craft"
cask "hiddenbar"
cask "notion"
cask "mysqlworkbench"
cask "intellij-idea"
cask "fig" # Command line tool
cask "deepl"
cask "dotnet-sdk"
cask "malwarebytes"
cask "itsycal" # Toolbar Calendar
cask "discord"
cask "keka" # MacOS File Archiver
cask "docker"
cask "gitkraken"
cask "alt-tab"
cask "azure-data-studio"
cask "dbngin" # All-in-One Database Version Management Tool
cask "tableplus" # Database Management
cask "shottr" # Free Screenshot Tool
cask "background-music" # Open Source Audio Mixing App: https://github.com/kyleneideck/BackgroundMusic
cask "command-x" # Cut Files
cask "stats" # System monitor for the menu bar
cask "syntax-highlight", args: { no_quarantine: true } # Preview many different source code files with syntax highlighting

# 'mas install'
mas "Adobe Lightroom", id: 1451544217
mas "CapCut - Video Editor", id: 1500855883
mas "Xcode", id: 497799835
mas "Malwarebytes Browser Guard", id: 1577761052
mas "DaVinci Resolve", id: 571213070
mas "Bitwarden", id: 1352778147
